* TODO Observational constraints on EUV dust opacity in H II regions
+ Binder:2018a found that the dust absorption fraction for Ly-continuum photons is 34% on average, and 51% for the most luminous regions
  + To get this, they assume that the escape fraction for ionizing photons is the same as the escape fraction for all the photons - I guess this should be more-or-less true, but it needs checking
  + Escape fractions are about 30% on average, but large variation
  + Orion has f_{esc} = 0.17 +/- 0.06 and f_{C,abs} = 0.57 +/- 0.38
+ So from this, we can find what the EUV dust \tau is for the region
  + And I suspect this is /not/ just (1 - exp(-\tau)) = f_{C,abs}
  + Instead, we need to do it like sec 2.2 of Pastor:1991a
  + Although it looks like the correction is small: 0.37/0.45 perhaps
  + So assume it is just \tau = -ln(1 - f_{C,abs})
+ To get the \kappa we need to relate \tau to the mass column \Sigma, which we can get from the emission measure and assuming a filling factor
  + \tau = \Sigma \kappa
  + \Sigma = n m \epsilon R
  + Binder:2019a calculate N'_{C}, which is number of ionizing photons required to explain thermal radio emission by free-free from ionized gas
    + We can equate that with the VEM times the recombination coefficient
    + N'_{C} = \alpha_{B} \epsilon n^{2} 4 \pi R^{3} / 3
      + n R = \Sigma / m \epsilon
    + N'_{C} = \alpha_{B} \Sigma^{2} 4 \pi R / 3 m^{2} \epsilon
    + \Sigma = m sqrt(3 \epsilon N'_{C} / 4 \pi \alpha_B R)
    + \Sigma = 2.16e-3 sqrt(\epsilon N'_{49} / R_{pc}) g/cm^2
    + We can also find the density
      + n \epsilon^0.5 = 560 sqrt(N'_{49} / R_{pc}^3)
    + And ionizing flux in units of 10^10 /cm^2/s
      + \Phi_10 = 8.35 N'_{49} / R_{pc}^2
    + And bolometric flux in ISM units
      + U = 14700 L_6 / R_{pc}^2
    + Ionization parameter \Xi_ion = \Phi / n c
      + \Xi_ion = 0.333 \Phi_10 / nag
    + Radiation parameter \Xi_rad = P_rad/P_gas
      + \Xi_rad = U / 3.82 n
** Empirical calculations of \tau and \kappa for the dust
+ In the tables below, I do the calculations
+ Unfortunately, the errors are enormous, even taking the ones from Binder:2019a at face value
+ But we can draw some general conclusions:
  1. N'_C/N_C is consistently smaller than L_TIR/L_*
     - This means that /some/ EUV photons are absorbed by dust: f_c,abs > 0
     - But there are some objects where this is not true, so we only get upper limits on f_c,abs
     - There are also some with  f_c,abs > 1, which is impossible.  These tend to be ones with measured L_TIR/L_* > 2, which suggests big observational errors (maybe the distance is wrong)
  2. L_TIR/L_* is on average very close to 1, meaning that the escape fraction is small
     - In the paper, they seem to discard the L_TIR/L_* > 1 measurements, which means they are biased towards smaller values
  3. The simple average dust absorption fraction is f_c,abs = 0.33 => \tau = 0.4
  4. There is clearly a correlation with L_TIR
     - Low luminosity, median L_TIR = 3.5e5 Lsun, f_c,abs = 0.18 => \tau = 0.20 +/- 0.09
     - High luminosity, median L_TIR= 5e6 Lsun, f_c,abs = 0.43 => \tau = 0.56 +/- 0.10
+ So we can now calculate the \kappa for the sub-samples:
  | Subsample | L_TIR (10^6) |   L_* | N'_C (10^49) | R (pc) | \tau             | \Sigma / sqrt(\epsilon) | \kappa sqrt(\epsilon)    |    U |  \Phi_10 | n sqrt(\epsilon) |   \Xi_ion |   \Xi_rad |
  |-----------+------------+------+------------+--------+---------------+-------------+--------------+------+------+-----------+--------+--------|
  | Low L     |       0.35 | 0.74 |        1.4 |    2.4 | 0.20 +/- 0.09 |      0.0016 | 125. +/- 56. | 189. | 2.03 |      178. | 0.0038 | 0.3542 |
  | High L    |        5.0 |  6.9 |      17.45 |    7.6 | 0.56 +/- 0.10 |      0.0033 | 170. +/- 30. | 176. | 2.52 |      112. | 0.0075 | 0.5242 |
  #+TBLFM: $7=2.16e-3 sqrt( $4/$5 ) ;f4::$8=$-2/$-1;f0::$9=14.7 100 $3/$5**2 ;f0::$10=8.35 $4 /$5**2 ;f2::$11=560 sqrt($4/$5**3) ;f0::$12=1e10 $-2 / $c $-1 ;f4::$13=1e10 $-4 / $c $-2 ;f4
  + I have taken half of the aperture radius for the R - should do a better job on that
  + The U is calculated at outer radius R but with no attenuation
    + Multiply by 4  
  + So we really need a good handle on the filling factor \epsilon
    + With \epsilon = 0.05 or so, we can get \kappa = 600 cm^2/g, which is what I have been using
** Tables derived from Binder:2009a
+ I just want the luminosities, and then I will recalculate the fractions, but keeping the "unphysical" values instead of discarding them
+ Also, keep the aperture radius since I may use 1/2 of that as the H II region radius
+ Bottom rows give:
  1. Mean over whole sample
  2. Mean over low L_TIR sub-sample
  3. Mean over high L_TIR sub-sample
  4. Median over whole sample
  5. Median over low L_TIR sub-sample
  6. Median over high L_TIR sub-sample
+ Note that for L_TIR and L_* especially, the mean is weirdly low since it is heavily weighted towards the sources with small errors, which are the lowest luminosity ones
  + That is why I did the medians as well
| Name        | Aper  |           Aper | ${N}_{C}^{{\prime} }$      | OB Stars  N_C    |                 | L_TIR^a           | L_sstarf         |               |                |                |                |
|             | Rad   |           (pc) | (10^49)          | (10^49 s^-1)      | N/N             | (10^6 L_sun)      | (10^6 L_sun)      | L/L           | log(N/N)       | log(L/L)       | f_c,abs         |
|-------------+-------+----------------+-----------------+-----------------+-----------------+-----------------+-----------------+---------------+----------------+----------------+----------------|
| Flame       | 15.'9 |            1.5 | 0.03 +/- 0.01   | 0.15 +/- 0.07   | 0.20 +/- 0.11   | 0.04 +/- 0.01   | 0.09 +/- 0.02   | 0.44 +/- 0.15 | -0.70 +/- 0.24 | -0.36 +/- 0.15 | 0.24 +/- 0.19  |
| W40         | 22.'4 |            3.3 | 0.04 +/- 0.01   | 0.09 +/- 0.05   | 0.44 +/- 0.27   | 0.04 +/- 0.01   | 0.07 +/- 0.01   | 0.57 +/- 0.16 | -0.36 +/- 0.27 | -0.24 +/- 0.12 | 0.13 +/- 0.31  |
| Wd 1^b       | 2.'8  |            3.2 | 3 +/- 6         | 6.33 +/- 4.11   | 0.47 +/- 1.00   | 0.09 +/- 0.04   | 2.64 +/- 0.65   | 0.03 +/- 0.02 | -0.33 +/- 0.92 | -1.52 +/- 0.29 | -0.44 +/- 1.00 |
| RCW36       | 16.'4 |            5.2 | 0.12 +/- 0.02   | 0.19 +/- 0.09   | 0.63 +/- 0.32   | 0.10 +/- 0.03   | 0.11 +/- 0.02   | 0.91 +/- 0.32 | -0.20 +/- 0.22 | -0.04 +/- 0.15 | 0.28 +/- 0.45  |
| Berkeley 87 | 8.'4  |            4.3 | 0.34 +/- 0.17   | 1.86 +/- 0.72   | 0.18 +/- 0.12   | 0.17 +/- 0.07   | 0.72 +/- 0.15   | 0.24 +/- 0.11 | -0.74 +/- 0.29 | -0.62 +/- 0.20 | 0.06 +/- 0.16  |
| Orion       | 22.'6 |            2.7 | 0.2 +/- 0.1     | 0.77 +/- 0.23   | 0.26 +/- 0.15   | 0.24 +/- 0.07   | 0.29 +/- 0.04   | 0.83 +/- 0.27 | -0.59 +/- 0.25 | -0.08 +/- 0.14 | 0.57 +/- 0.31  |
| Lagoon^c     | 13.'0 |            4.4 | 1.1 +/- 0.2     | 3.71 +/- 2.09   | 0.30 +/- 0.18   | 0.32 +/- 0.07   | 1.14 +/- 0.27   | 0.28 +/- 0.09 | -0.52 +/- 0.26 | -0.55 +/- 0.14 | -0.02 +/- 0.20 |
| Trifid      | 16.'9 |            7.7 | 1.5 +/- 0.4     | 0.58 +/- 0.22   | 2.59 +/- 1.20   | 0.37 +/- 0.11   | 0.16 +/- 0.04   | 2.31 +/- 0.90 | 0.41 +/- 0.20  | 0.36 +/- 0.17  | -0.28 +/- 1.50 |
| W42         | 5.'2  |            3.3 | 1.9 +/- 0.1     | 1.71 +/- 0.54   | 1.11 +/- 0.36   | 0.37 +/- 0.10   | 0.35 +/- 0.08   | 1.06 +/- 0.37 | 0.05 +/- 0.14  | 0.03 +/- 0.15  | -0.05 +/- 0.52 |
| NGC 7538^d   | 8.'0  |            6.2 | 1.3 +/- 0.1     | 4.74 +/- 0.89   | 0.27 +/- 0.06   | 0.59 +/- 0.16   | 1.01 +/- 0.13   | 0.58 +/- 0.18 | -0.57 +/- 0.10 | -0.24 +/- 0.13 | 0.31 +/- 0.19  |
| W4^b^,^e      | 55.'7 |           36.3 | 5 +/- 10        | 11.50 +/- 2.12  | 0.43 +/- 0.87   | 0.77 +/- 0.07   | 2.60 +/- 0.28   | 0.30 +/- 0.04 | -0.37 +/- 0.88 | -0.52 +/- 0.06 | -0.13 +/- 0.87 |
| Eagle       | 20.'5 |           10.2 | 1.6 +/- 0.4     | 4.31 +/- 2.88   | 0.37 +/- 0.26   | 1.12 +/- 0.32   | 2.01 +/- 0.41   | 0.56 +/- 0.20 | -0.43 +/- 0.31 | -0.25 +/- 0.16 | 0.19 +/- 0.33  |
| W33         | 12.'0 |            8.4 | 4.6 +/- 0.8     | 10.78 +/- 1.30  | 0.43 +/- 0.09   | 1.18 +/- 0.29   | 1.98 +/- 0.16   | 0.60 +/- 0.15 | -0.37 +/- 0.09 | -0.22 +/- 0.11 | 0.17 +/- 0.17  |
| RCW38       | 21.'2 |           10.5 | 2.6 +/- 0.1     | 3.50 +/- 1.36   | 0.74 +/- 0.29   | 1.22 +/- 0.20   | 0.76 +/- 0.18   | 1.61 +/- 0.46 | -0.13 +/- 0.17 | 0.21 +/- 0.12  | 0.87 +/- 0.54  |
|-------------+-------+----------------+-----------------+-----------------+-----------------+-----------------+-----------------+---------------+----------------+----------------+----------------|
| W3          | 13.'4 |            8.5 | 2.9 +/- 0.2     | 5.87 +/- 2.37   | 0.49 +/- 0.20   | 1.38 +/- 0.32   | 1.68 +/- 0.31   | 0.82 +/- 0.24 | -0.31 +/- 0.18 | -0.09 +/- 0.13 | 0.33 +/- 0.31  |
| NGC 3576    | 12.'9 |           10.4 | 4.0 +/- 0.1     | 2.71 +/- 1.26   | 1.48 +/- 0.69   | 1.65 +/- 0.12   | 0.88 +/- 0.16   | 1.88 +/- 0.37 | 0.17 +/- 0.20  | 0.27 +/- 0.09  | 0.40 +/- 0.78  |
| NGC 6334    | 19.'8 |            9.4 | 2.8 +/- 0.3     | 4.24 +/- 1.74   | 0.66 +/- 0.28   | 2.72 +/- 0.63   | 1.17 +/- 0.27   | 2.32 +/- 0.76 | -0.18 +/- 0.18 | 0.37 +/- 0.14  | 1.66 +/- 0.81  |
| G29.96-0.02 | 9.'7  |           17.5 | 15.4 +/- 0.4    | 4.17 +/- 0.51   | 3.69 +/- 0.46   | 3.96 +/- 0.88   | 0.74 +/- 0.06   | 5.35 +/- 1.27 | 0.57 +/- 0.05  | 0.73 +/- 0.10  | 1.66 +/- 1.35  |
| NGC 6357    | 25.'8 |           13.4 | 6.4 +/- 0.2     | 32.95 +/- 3.41  | 0.19 +/- 0.02   | 4.33 +/- 0.34   | 7.13 +/- 0.53   | 0.61 +/- 0.07 | -0.72 +/- 0.05 | -0.21 +/- 0.05 | 0.42 +/- 0.07  |
| M17         | 23.'0 |           12.2 | 7.4 +/- 0.6     | 22.39 +/- 4.08  | 0.33 +/- 0.07   | 4.46 +/- 1.28   | 5.89 +/- 0.54   | 0.76 +/- 0.23 | -0.48 +/- 0.09 | -0.12 +/- 0.13 | 0.43 +/- 0.24  |
| G333        | 7.'5  |            5.7 | 11.1 +/- 0.2    | 8.30 +/- 1.26   | 1.34 +/- 0.20   | 4.80 +/- 1.29   | 1.55 +/- 0.18   | 3.10 +/- 0.91 | 0.13 +/- 0.06  | 0.49 +/- 0.13  | 1.76 +/- 0.93  |
| W43         | 7.'5  |           12.0 | 57.4 +/- 9.5    | 39.70 +/- 1.95  | 1.45 +/- 0.25   | 5.19 +/- 1.37   | 7.10 +/- 0.25   | 0.73 +/- 0.19 | 0.16 +/- 0.07  | -0.14 +/- 0.11 | -0.72 +/- 0.31 |
| RCW49       | 19.'6 |           25.1 | 26.3 +/- 3.0    | 56.24 +/- 2.82  | 0.47 +/- 0.06   | 9.02 +/- 2.03   | 10.38 +/- 0.42  | 0.87 +/- 0.20 | -0.33 +/- 0.06 | -0.06 +/- 0.10 | 0.40 +/- 0.21  |
| G305        | 40.'8 |           42.6 | 19.5 +/- 3.5    | 29.31 +/- 2.34  | 0.67 +/- 0.13   | 13.73 +/- 3.74  | 6.70 +/- 0.34   | 2.05 +/- 0.57 | -0.17 +/- 0.08 | 0.31 +/- 0.12  | 1.38 +/- 0.58  |
| W49A        | 6.'7  |           22.2 | 38.3 +/- 9.2    | 60.89 +/- 3.18  | 0.63 +/- 0.15   | 15.61 +/- 3.63  | 10.53 +/- 0.45  | 1.48 +/- 0.35 | -0.20 +/- 0.10 | 0.17 +/- 0.10  | 0.85 +/- 0.38  |
| Carina      | 63.'9 |           50.0 | 29.0 +/- 3.1    | 93.79 +/- 6.43  | 0.31 +/- 0.04   | 17.51 +/- 5.31  | 22.76 +/- 0.97  | 0.77 +/- 0.24 | -0.51 +/- 0.06 | -0.11 +/- 0.14 | 0.46 +/- 0.24  |
| W51A        | 31.'8 |           47.2 | 33.5 +/- 5.2    | 42.95 +/- 2.81  | 0.78 +/- 0.13   | 17.88 +/- 4.86  | 9.15 +/- 0.43   | 1.95 +/- 0.54 | -0.11 +/- 0.07 | 0.29 +/- 0.12  | 1.17 +/- 0.56  |
| NGC 3603    | 12.'4 |           25.2 | 31.1 +/- 0.9    | 137.08 +/- 5.02 | 0.23 +/- 0.01   | 23.10 +/- 6.40  | 23.03 +/- 0.74  | 1.00 +/- 0.28 | -0.64 +/- 0.02 | 0.00 +/- 0.12  | 0.77 +/- 0.28  |
|-------------+-------+----------------+-----------------+-----------------+-----------------+-----------------+-----------------+---------------+----------------+----------------+----------------|
|             |       | 14.59 +/- 2.63 | 0.12 +/- 6.6e-3 | 0.28 +/- 0.04   | 0.25 +/- 8.3e-3 | 0.07 +/- 6.6e-3 | 0.15 +/- 7.7e-3 | 0.19 +/- 0.02 | -0.39 +/- 0.01 | -0.07 +/- 0.02 | 0.33 +/- 0.04  |
|-------------+-------+----------------+-----------------+-----------------+-----------------+-----------------+-----------------+---------------+----------------+----------------+----------------|
|             |       |  7.66 +/- 2.33 | 0.07 +/- 6.6e-3 | 0.19 +/- 0.04   | 0.31 +/- 0.04   | 0.06 +/- 6.6e-3 | 0.11 +/- 7.8e-3 | 0.13 +/- 0.02 | -0.33 +/- 0.05 | -0.29 +/- 0.03 | 0.18 +/- 0.07  |
|             |       | 21.53 +/- 3.99 | 5.62 +/- 0.07   | 10.82 +/- 0.39  | 0.24 +/- 8.5e-3 | 2.05 +/- 0.10   | 1.81 +/- 0.05   | 0.78 +/- 0.05 | -0.39 +/- 0.01 | 0.07 +/- 0.03  | 0.43 +/- 0.06  |
|-------------+-------+----------------+-----------------+-----------------+-----------------+-----------------+-----------------+---------------+----------------+----------------+----------------|
|             |       |           9.80 | 3.50            | 5.31            | 0.47            | 1.30            | 1.62            | 0.83          | -0.33          | -0.09          | 0.37           |
|-------------+-------+----------------+-----------------+-----------------+-----------------+-----------------+-----------------+---------------+----------------+----------------+----------------|
|             |       |           4.80 | 1.40            | 2.68            | 0.43            | 0.35            | 0.74            | 0.58          | -0.37          | -0.24          | 0.15           |
|             |       |          15.45 | 17.45           | 31.13           | 0.65            | 5.00            | 6.90            | 1.24          | -0.19          | 0.09           | 0.62           |
#+TBLFM: $6=$4/$5 ;f2::$9=$7/$8;f2::$10=log10($6);f2::$11=log10($9);f2::$12=$9 - $6;f2::@31$3..@31$12=vmeane(@I..@III);f2::@32$3..@32$12=vmeane(@I..@II);f2::@33$3..@33$12=vmeane(@II..@III);f2::@34$3..@34$12=vmedian(@I..@III);f2::@35$3..@35$12=vmedian(@I..@II);f2::@36$3..@36$12=vmedian(@II..@III);f2


Do what I did above for the whole sample

| Name        |    R | ${N}_{C}^{{\prime} }$    | L_sstarf        |                |                        |                   |                          |                  |               |                   |
|             | (pc) | (10^49)        | (10^6 L_sun)     | f_c,abs         | \tau                      | \Sigma / sqrt(\epsilon)       | \kappa sqrt(\epsilon)                | U                | n sqrt(\epsilon)     | \Xi_ion              |
|-------------+------+---------------+----------------+----------------+------------------------+-------------------+--------------------------+------------------+---------------+-------------------|
| Flame       |  0.8 | 0.03 +/- 0.01 | 0.09 +/- 0.02  | 0.24 +/- 0.19  | 0.27 +/- 0.25          | 4.2e-4 +/- 7.0e-5 | 643. +/- 605.            | 2067. +/- 459.   | 136. +/- 23.  | 0.0010 +/- 0.0004 |
| W40         |  1.7 | 0.04 +/- 0.01 | 0.07 +/- 0.01  | 0.13 +/- 0.31  | 0.14 +/- 0.36          | 3.3e-4 +/- 4.1e-5 | 424. +/- 1092.           | 356. +/- 51.     | 51. +/- 6.    | 0.0008 +/- 0.0002 |
| Wd 1^b       |  1.6 | 3 +/- 6       | 2.64 +/- 0.65  | -0.44 +/- 1.00 | -0.36 +/- 0.69         | 3.0e-3 +/- 3.0e-3 | -120. +/- 259.           | 15159. +/- 3732. | 479. +/- 479. | 0.0068 +/- 0.0152 |
| RCW36       |  2.6 | 0.12 +/- 0.02 | 0.11 +/- 0.02  | 0.28 +/- 0.45  | 0.33 +/- 0.63          | 4.6e-4 +/- 3.9e-5 | 717. +/- 1371.           | 239. +/- 43.     | 46. +/- 4.    | 0.0011 +/- 0.0002 |
| Berkeley 87 |  2.2 | 0.34 +/- 0.17 | 0.72 +/- 0.15  | 0.06 +/- 0.16  | 0.06 +/- 0.17          | 8.5e-4 +/- 2.1e-4 | 71. +/- 201.             | 2187. +/- 456.   | 100. +/- 25.  | 0.0020 +/- 0.0011 |
| Orion       |  1.4 | 0.2 +/- 0.1   | 0.29 +/- 0.04  | 0.57 +/- 0.31  | 0.84 +/- 0.72          | 8.2e-4 +/- 2.0e-4 | 1024. +/- 913.           | 2175. +/- 300.   | 151. +/- 38.  | 0.0019 +/- 0.0011 |
| Lagoon^c     |  2.2 | 1.1 +/- 0.2   | 1.14 +/- 0.27  | -0.02 +/- 0.20 | -0.02 +/- 0.20         | 1.5e-3 +/- 1.4e-4 | -13. +/- 133.            | 3462. +/- 820.   | 180. +/- 16.  | 0.0035 +/- 0.0007 |
| Trifid      |  3.9 | 1.5 +/- 0.4   | 0.16 +/- 0.04  | -0.28 +/- 1.50 | -0.25 +/- 1.17         | 1.3e-3 +/- 1.8e-4 | -192. +/- 900.           | 155. +/- 39.     | 89. +/- 12.   | 0.0031 +/- 0.0009 |
| W42         |  1.7 | 1.9 +/- 0.1   | 0.35 +/- 0.08  | -0.05 +/- 0.52 | -0.05 +/- 0.50         | 2.3e-3 +/- 6.0e-5 | -22. +/- 217.            | 1780. +/- 407.   | 348. +/- 9.   | 0.0053 +/- 0.0003 |
| NGC 7538^d   |  3.1 | 1.3 +/- 0.1   | 1.01 +/- 0.13  | 0.31 +/- 0.19  | 0.37 +/- 0.28          | 1.4e-3 +/- 5.4e-5 | 264. +/- 200.            | 1545. +/- 199.   | 117. +/- 4.   | 0.0032 +/- 0.0003 |
| W4^b^,^e      | 18.2 | 5 +/- 10      | 2.60 +/- 0.28  | -0.13 +/- 0.87 | -0.12 +/- 0.77         | 1.1e-3 +/- 1.1e-3 | -109. +/- 708.           | 115. +/- 12.     | 16. +/- 16.   | 0.0026 +/- 0.0059 |
| Eagle       |  5.1 | 1.6 +/- 0.4   | 2.01 +/- 0.41  | 0.19 +/- 0.33  | 0.21 +/- 0.41          | 1.2e-3 +/- 1.5e-4 | 175. +/- 342.            | 1136. +/- 232.   | 62. +/- 8.    | 0.0028 +/- 0.0008 |
| W33         |  4.2 | 4.6 +/- 0.8   | 1.98 +/- 0.16  | 0.17 +/- 0.17  | 0.19 +/- 0.20          | 2.3e-3 +/- 2.0e-4 | 83. +/- 87.              | 1650. +/- 133.   | 140. +/- 12.  | 0.0052 +/- 0.0010 |
| RCW38       |  5.3 | 2.6 +/- 0.1   | 0.76 +/- 0.18  | 0.87 +/- 0.54  | 2.04 +/- 4.15          | 1.5e-3 +/- 2.9e-5 | 1360. +/- 2767.          | 398. +/- 94.     | 74. +/- 1.    | 0.0035 +/- 0.0001 |
|-------------+------+---------------+----------------+----------------+------------------------+-------------------+--------------------------+------------------+---------------+-------------------|
| W3          |  4.3 | 2.9 +/- 0.2   | 1.68 +/- 0.31  | 0.33 +/- 0.31  | 0.40 +/- 0.46          | 1.8e-3 +/- 6.1e-5 | 222. +/- 256.            | 1336. +/- 246.   | 107. +/- 4.   | 0.0041 +/- 0.0003 |
| NGC 3576    |  5.2 | 4.0 +/- 0.1   | 0.88 +/- 0.16  | 0.40 +/- 0.78  | 0.51 +/- 1.30          | 1.9e-3 +/- 2.4e-5 | 268. +/- 684.            | 478. +/- 87.     | 94. +/- 1.    | 0.0044 +/- 0.0001 |
| NGC 6334    |  4.7 | 2.8 +/- 0.3   | 1.17 +/- 0.27  | 1.66 +/- 0.81  | (0.42, -3.14) +/- 1.23 | 1.7e-3 +/- 8.9e-5 | (247., -1847.) +/- 730.  | 779. +/- 180.    | 92. +/- 5.    | 0.0038 +/- 0.0005 |
| G29.96-0.02 |  8.8 | 15.4 +/- 0.4  | 0.74 +/- 0.06  | 1.66 +/- 1.35  | (0.42, -3.14) +/- 2.05 | 2.9e-3 +/- 3.7e-5 | (145., -1083.) +/- 707.  | 140. +/- 11.     | 84. +/- 1.    | 0.0066 +/- 0.0002 |
| NGC 6357    |  6.7 | 6.4 +/- 0.2   | 7.13 +/- 0.53  | 0.42 +/- 0.07  | 0.54 +/- 0.12          | 2.1e-3 +/- 3.3e-5 | 257. +/- 57.             | 2335. +/- 174.   | 82. +/- 1.    | 0.0048 +/- 0.0002 |
| M17         |  6.1 | 7.4 +/- 0.6   | 5.89 +/- 0.54  | 0.43 +/- 0.24  | 0.56 +/- 0.42          | 2.4e-3 +/- 9.6e-5 | 233. +/- 175.            | 2327. +/- 213.   | 101. +/- 4.   | 0.0055 +/- 0.0005 |
| G333        |  2.9 | 11.1 +/- 0.2  | 1.55 +/- 0.18  | 1.76 +/- 0.93  | (0.27, -3.14) +/- 1.22 | 4.2e-3 +/- 3.8e-5 | (64., -748.) +/- 291.    | 2709. +/- 315.   | 378. +/- 3.   | 0.0097 +/- 0.0002 |
| W43         |  6.0 | 57.4 +/- 9.5  | 7.10 +/- 0.25  | -0.72 +/- 0.31 | -0.54 +/- 0.18         | 6.7e-3 +/- 5.5e-4 | -81. +/- 28.             | 2899. +/- 102.   | 289. +/- 24.  | 0.0153 +/- 0.0028 |
| RCW49       | 12.6 | 26.3 +/- 3.0  | 10.38 +/- 0.42 | 0.40 +/- 0.21  | 0.51 +/- 0.35          | 3.1e-3 +/- 1.8e-4 | 165. +/- 113.            | 961. +/- 39.     | 64. +/- 4.    | 0.0072 +/- 0.0009 |
| G305        | 21.3 | 19.5 +/- 3.5  | 6.70 +/- 0.34  | 1.38 +/- 0.58  | (0.97, -3.14) +/- 1.53 | 2.1e-3 +/- 1.9e-4 | (462., -1495.) +/- 742.  | 217. +/- 11.     | 25. +/- 2.    | 0.0048 +/- 0.0009 |
| W49A        | 11.1 | 38.3 +/- 9.2  | 10.53 +/- 0.45 | 0.85 +/- 0.38  | 1.90 +/- 2.53          | 4.0e-3 +/- 4.8e-4 | 475. +/- 635.            | 1256. +/- 54.    | 94. +/- 11.   | 0.0092 +/- 0.0025 |
| Carina      | 25.0 | 29.0 +/- 3.1  | 22.76 +/- 0.97 | 0.46 +/- 0.24  | 0.62 +/- 0.44          | 2.3e-3 +/- 1.2e-4 | 270. +/- 192.            | 535. +/- 23.     | 24. +/- 1.    | 0.0054 +/- 0.0006 |
| W51A        | 23.6 | 33.5 +/- 5.2  | 9.15 +/- 0.43  | 1.17 +/- 0.56  | (1.77, -3.14) +/- 3.29 | 2.6e-3 +/- 2.0e-4 | (681., -1208.) +/- 1270. | 241. +/- 11.     | 28. +/- 2.    | 0.0060 +/- 0.0010 |
| NGC 3603    | 12.6 | 31.1 +/- 0.9  | 23.03 +/- 0.74 | 0.77 +/- 0.28  | 1.47 +/- 1.22          | 3.4e-3 +/- 4.9e-5 | 432. +/- 359.            | 2132. +/- 69.    | 70. +/- 1.    | 0.0078 +/- 0.0003 |
|-------------+------+---------------+----------------+----------------+------------------------+-------------------+--------------------------+------------------+---------------+-------------------|
#+TBLFM: $6=-ln(1 - $5);f2::$7=2.16e-3 sqrt($3/$2) ;s2::$8=$-2 / $-1 ;f0::$9=14700 $4 / $2**2 ;f0::$10=560 sqrt($3/$2**3);f0::$11=0.333 8.35 $3 / $2**2 $-1;f4





** Original Binder:2019a Tables
*** Table 2
| Name        | Aperture        |  U_1 | q_PAH,1 | U_min,2 | U_max,2 | q_PAH,2 | f_bol | 1-gamma       | L_TIR^a           | T_BB           | alpha           | f_Bralpha | ${N}_{C}^{{\prime} }$     | ${\chi }_{r}^{2}$ |
|             | Radius          |     |    (%) |        |        |    (%) |  (%) | (10^-5)        | (10^6 L_sun)      | (K)           |                 |      (%) | (10^49)         |          |
|-------------+-----------------+-----+--------+--------+--------+--------+------+---------------+-----------------+---------------+-----------------+----------+----------------+----------|
| (1)         | (2)             | (3) |    (4) |    (5) |    (6) |    (7) |  (8) | (9)           | (10)            | (11)          | (12)            |     (13) | (14)           |     (15) |
|-------------+-----------------+-----+--------+--------+--------+--------+------+---------------+-----------------+---------------+-----------------+----------+----------------+----------|
| Flame       | 15.'9 (1.5 pc)  | 10^5 |   4.58 |   0.50 |    10^5 |   0.47 |   41 | 7.5 +or- 0.9  | 0.04 +or- 0.01  | 34.9 +or- 9.3 | -0.10 +or- 0.01 |        2 | 0.03 +or- 0.01 |      5.0 |
| W40         | 22.'4 (3.3 pc)  | 10^5 |   3.19 |  cdots |  cdots |  cdots |   26 | cdots         | 0.04 +or- 0.01  | 25.8 +or- 1.3 | -0.09 +or- 0.01 |        2 | 0.04 +or- 0.01 |      7.2 |
| Wd 1^b       | 2.'8 (3.2 pc)   | 10^5 |   4.58 |   1.00 |    10^5 |   3.19 |  100 | 84.1 +or- 9.9 | 0.09 +or- 0.04  | 8.0 +or- 7.5  | cdots           |    cdots | cdots          |     11.5 |
| RCW36       | 16.'4 (5.2 pc)  | 10^5 |   4.58 |   0.50 |    10^5 |   4.58 |   49 | 5.2 +or- 0.3  | 0.10 +or- 0.03  | 24.2 +or- 2.4 | -0.10 +or- 0.02 |        3 | 0.12 +or- 0.02 |      3.2 |
| Berkeley 87 | 8.'4 (4.3 pc)   | 10^5 |   1.12 |   0.50 |    10^5 |   4.58 |   43 | 5.7 +or- 0.9  | 0.17 +or- 0.07  | 27.4 +or- 4.1 | -0.09 +or- 0.01 |       11 | 0.34 +or- 0.17 |      2.2 |
| Orion       | 22.'6 (2.7 pc)  | 10^5 |   2.50 |   0.50 |    10^5 |   3.90 |   61 | 5.8 +or- 0.9  | 0.24 +or- 0.07  | 36.2 +or- 3.0 | -0.09 +or- 0.01 |       26 | 0.2 +or- 0.1   |      2.7 |
| Lagoon^c     | 13.'0 (4.4 pc)  | 10^5 |   3.19 |   0.50 |    10^5 |   1.12 |   72 | 5.0 +or- 0.2  | 0.32 +or- 0.07  | 29.6 +or- 2.2 | -0.09 +or- 0.01 |       17 | 1.1 +or- 0.2   |      1.6 |
| Trifid      | 16.'9 (7.7 pc)  | 10^3 |   2.50 |   0.50 |    10^3 |   4.58 |   87 | 5.0 +or- 0.8  | 0.37 +or- 0.11  | 20.9 +or- 3.1 | -0.09 +or- 0.01 |        6 | 1.5 +or- 0.4   |      1.8 |
| W42         | 5.'2 (3.3 pc)   | 10^5 |   1.77 |   0.50 |    10^5 |   2.50 |   60 | 5.5 +or- 0.8  | 0.37 +or- 0.10  | 26.4 +or- 0.8 | -0.10 (fixed)   |       25 | 1.9 +or- 0.1   |      1.3 |
| NGC 7538^d   | 8.'0 (6.2 pc)   | 10^5 |   4.58 |   0.50 |    10^5 |   1.12 |   58 | 6.3 +or- 0.2  | 0.59 +or- 0.16  | 27.0 +or- 4.0 | -0.07 +or- 0.01 |        7 | 1.3 +or- 0.1   |      2.1 |
| W4^b^,^e      | 55.'7 (36.3 pc) | 10^5 |   4.58 |   0.50 |    10^5 |   4.58 |   26 | 5.0 +or- 0.3  | 0.77 +or- 0.07  | 24.8 +or- 1.2 | cdots           |    cdots | cdots          |      2.6 |
| Eagle       | 20.'5 (10.2 pc) | 10^5 |   0.47 |  cdots |  cdots |  cdots |   53 | cdots         | 1.12 +or- 0.32  | 22.1 +or- 1.8 | -0.10 +or- 0.02 |       86 | 1.6 +or- 0.4   |      7.5 |
| W33         | 12.'0 (8.4 pc)  | 10^5 |   1.12 |   0.50 |    10^4 |   0.47 |   35 | 4.9 +or- 0.4  | 1.18 +or- 0.29  | 25.5 +or- 1.8 | -0.09 +or- 0.01 |       39 | 4.6 +or- 0.8   |      6.2 |
| RCW38       | 21.'2 (10.5 pc) | 10^5 |   2.50 |   0.50 |    10^5 |   3.90 |   59 | 5.0 +or- 0.1  | 1.22 +or- 0.20  | 29.9 +or- 1.2 | -0.09 +or- 0.01 |        8 | 2.6 +or- 0.1   |      1.7 |
| W3          | 13.'4 (8.5 pc)  | 10^5 |   3.90 |   0.50 |    10^5 |   2.50 |   45 | 7.1 +or- 1.1  | 1.38 +or- 0.32  | 32.6 +or- 1.1 | -0.08 +or- 0.01 |        7 | 2.9 +or- 0.2   |      2.2 |
| NGC 3576    | 12.'9 (10.4 pc) | 10^5 |   1.77 |   0.50 |    10^5 |   3.90 |   52 | 5.8 +or- 0.4  | 1.65 +or- 0.12  | 30.6 +or- 0.7 | -0.10 (fixed)   |       13 | 4.0 +or- 0.1   |      2.5 |
| NGC 6334    | 19.'8 (9.4 pc)  | 10^5 |   4.58 |   0.50 |    10^5 |   1.12 |   50 | 6.1 +or- 0.3  | 2.72 +or- 0.63  | 30.2 +or- 1.4 | -0.11 +or- 0.02 |        7 | 2.8 +or- 0.3   |      2.0 |
| G29.96-0.02 | 9.'7 (17.5 pc)  | 10^5 |   3.19 |   0.50 |    10^5 |   2.50 |   37 | 4.6 +or- 0.2  | 3.96 +or- 0.88  | 29.3 +or- 1.0 | -0.10 (fixed)   |       14 | 15.4 +or- 0.4  |      1.3 |
| NGC 6357    | 25.'8 (13.4 pc) | 10^5 |   0.47 |   0.50 |    10^5 |   4.58 |   55 | 6.0 +or- 0.5  | 4.33 +or- 0.34  | 27.5 +or- 1.7 | -0.09 +or- 0.01 |        7 | 6.4 +or- 0.2   |      3.1 |
| M17         | 23.'0 (12.2 pc) | 10^5 |   1.77 |   0.50 |    10^5 |   4.58 |   67 | 5.8 +or- 0.2  | 4.46 +or- 1.28  | 32.1 +or- 4.4 | -0.09 +or- 0.01 |        5 | 7.4 +or- 0.6   |      2.1 |
|             | 9.'2 (7.0 pc),  |     |        |        |        |        |      |               |                 |               |                 |          |                |          |
| G333        | 7.'5 (5.7 pc),  | 10^5 |   0.47 |   0.50 |    10^5 |   3.90 |   51 | 4.9 +or- 0.7  | 4.80 +or- 1.29  | 36.3 +or- 1.9 | -0.07 +or- 0.01 |       18 | 11.1 +or- 0.2  |      1.9 |
|             | 9.'2 (7.0 pc)   |     |        |        |        |        |      |               |                 |               |                 |          |                |          |
| W43         | 7.'5 (12.0 pc)  | 10^5 |   1.12 |   0.50 |    10^5 |   3.19 |   46 | 5.5 +or- 0.8  | 5.19 +or- 1.37  | 28.3 +or- 0.9 | -0.10 +or- 0.02 |       51 | 57.4 +or- 9.5  |      1.9 |
| RCW49       | 19.'6 (25.1 pc) | 10^5 |   2.50 |   0.50 |    10^5 |   2.50 |   62 | 5.8 +or- 0.3  | 9.02 +or- 2.03  | 33.7 +or- 1.1 | -0.10 +or- 0.02 |       10 | 26.3 +or- 3.0  |      1.8 |
| G305        | 40.'8 (42.6 pc) | 10^5 |   0.47 |   0.50 |    10^5 |   4.58 |   42 | 5.4 +or- 0.8  | 13.73 +or- 3.74 | 26.9 +or- 1.7 | -0.11 +or- 0.02 |        8 | 19.5 +or- 3.5  |      4.1 |
| W49A        | 6.'7 (22.2 pc)  | 10^5 |   3.19 |   0.50 |    10^5 |   1.77 |   31 | 6.3 +or- 0.9  | 15.61 +or- 3.63 | 29.9 +or- 1.1 | -0.09 +or- 0.01 |       23 | 38.3 +or- 9.2  |      1.9 |
| Carina      | 63.'9 (50.0 pc) | 10^4 |   3.19 |   0.50 |    10^4 |   0.47 |   96 | 46.5 +or- 1.9 | 17.51 +or- 5.31 | 28.7 +or- 4.3 | -0.08 +or- 0.01 |        5 | 29.0 +or- 3.1  |      4.1 |
| W51A        | 31.'8 (47.2 pc) | 10^5 |   4.58 |   0.50 |    10^5 |   0.47 |   51 | 4.7 +or- 0.3  | 17.88 +or- 4.86 | 31.9 +or- 4.8 | -0.12 +or- 0.02 |        9 | 33.5 +or- 5.2  |      2.3 |
| NGC 3603    | 12.'4 (25.2 pc) | 10^5 |   1.12 |   0.50 |    10^5 |   2.50 |   56 | 12.6 +or- 1.1 | 23.10 +or- 6.40 | 40.6 +or- 6.1 | -0.10 (fixed)   |        8 | 31.1 +or- 0.9  |      3.3 |
*** Table 4
| Region       | OB Stars         |                    | SED Model/Stellar Population |                | f_esc           | f_C,abs         |
|              | N_C (10^49 s^-1)    | L_sstarf (10^6 L_sun) | ${N}_{C}^{{\prime} }/{N}_{C}$              | L_TIR/L_sstarf   |                |                |
|--------------+------------------+--------------------+------------------------------+----------------+----------------+----------------|
| (1)          | (2)              | (3)                | (4)                          | (5)            | (6)            | (7)            |
|--------------+------------------+--------------------+------------------------------+----------------+----------------+----------------|
| Flame^a       | 0.15 +or- 0.07   | 0.09 +or- 0.02     | 0.20 +or- 0.11               | 0.44 +or- 0.15 | 0.56 +or- 0.19 | 0.24 +or- 0.16 |
| W40          | 0.09 +or- 0.05   | 0.07 +or- 0.01     | 0.44 +or- 0.27               | 0.57 +or- 0.16 | 0.43 +or- 0.12 | 0.13 +or- 0.09 |
| Wd 1         | 6.33 +or- 4.11   | 2.64 +or- 0.65     | cdots                        | 0.03 +or- 0.02 | >0.32          | cdots          |
| RCW 36       | 0.19 +or- 0.09   | 0.11 +or- 0.02     | 0.63 +or- 0.32               | 0.91 +or- 0.32 | 0.09 +or- 0.03 | 0.28 +or- 0.17 |
| Berkeley 87  | 1.86 +or- 0.72   | 0.72 +or- 0.15     | 0.18 +or- 0.11               | 0.24 +or- 0.11 | >0.41          | 0.06 +or- 0.05 |
| Orion        | 0.77 +or- 0.23   | 0.29 +or- 0.04     | 0.26 +or- 0.15               | 0.83 +or- 0.27 | 0.17 +or- 0.06 | 0.57 +or- 0.38 |
| Lagoon^b      | 3.71 +or- 2.09   | 1.14 +or- 0.27     | 0.30 +or- 0.18               | 0.28 +or- 0.09 | 0.72 +or- 0.23 | 0              |
| Trifid^c      | 0.58 +or- 0.22   | 0.16 +or- 0.04     | 2.59 +or- 1.20               | 2.31 +or- 0.90 | cdots          | cdots          |
| W42          | 1.71 +or- 0.54   | 0.35 +or- 0.08     | 1.11 +or- 0.36               | 1.06 +or- 0.38 | cdots          | 0              |
| NGC 7538^a    | 4.74 +or- 0.89   | 1.01 +or- 0.13     | 0.27 +or- 0.05               | 0.58 +or- 0.17 | 0.42 +or- 0.12 | 0.31 +or- 0.10 |
| W4^b          | 11.50 +or- 2.12  | 2.60 +or- 0.28     | cdots                        | 0.30 +or- 0.03 | 0.70 +or- 0.07 | cdots          |
| Eagle^b       | 4.31 +or- 2.88   | 2.01 +or- 0.41     | 0.37 +or- 0.26               | 0.56 +or- 0.20 | 0.44 +or- 0.16 | 0.19 +or- 0.15 |
| W33          | 10.78 +or- 1.30  | 1.98 +or- 0.16     | 0.43 +or- 0.09               | 0.60 +or- 0.16 | 0.40 +or- 0.11 | 0.17 +or- 0.06 |
| RCW 38^a^,^b   | 3.50 +or- 1.36   | 0.76 +or- 0.18     | 0.74 +or- 0.29               | 1.61 +or- 0.46 | cdots          | cdots          |
| W3^b          | 5.87 +or- 2.37   | 1.68 +or- 0.31     | 0.49 +or- 0.20               | 0.82 +or- 0.24 | 0.18 +or- 0.05 | 0.30 +or- 0.17 |
| NGC 3576^c    | 2.71 +or- 1.26   | 0.88 +or- 0.16     | 1.48 +or- 0.69               | 1.88 +or- 0.37 | cdots          | cdots          |
| NGC 6334^b^,^c | 4.24 +or- 1.74   | 1.17 +or- 0.27     | 0.66 +or- 0.28               | 2.32 +or- 0.76 | cdots          | cdots          |
| G29.96-0.02^c | 4.17 +or- 0.51   | 0.74 +or- 0.06     | 3.69 +or- 0.46               | 5.35 +or- 1.24 | cdots          | cdots          |
| NGC 6357^b    | 32.95 +or- 3.41  | 7.13 +or- 0.53     | 0.19 +or- 0.02               | 0.61 +or- 0.07 | 0.39 +or- 0.04 | 0.42 +or- 0.07 |
| M17^b         | 22.39 +or- 4.08  | 5.89 +or- 0.54     | 0.33 +or- 0.07               | 0.76 +or- 0.23 | 0.24 +or- 0.07 | 0.43 +or- 0.16 |
| G333^a^,^c     | 8.30 +or- 1.26   | 1.55 +or- 0.18     | 1.33 +or- 0.20               | 1.22 +or- 0.36 | cdots          | cdots          |
| W43          | 39.70 +or- 1.95  | 7.10 +or- 0.25     | 1.44 +or- 0.25               | 0.73 +or- 0.19 | 0.27 +or- 0.07 | cdots          |
| RCW 49       | 56.24 +or- 2.82  | 10.38 +or- 0.42    | 0.47 +or- 0.06               | 0.87 +or- 0.20 | 0.13 +or- 0.03 | 0.40 +or- 0.11 |
| G305^c        | 29.31 +or- 2.34  | 6.70 +or- 0.34     | 0.67 +or- 0.13               | 2.05 +or- 0.57 | cdots          | cdots          |
| W49A^c        | 60.89 +or- 3.18  | 10.53 +or- 0.45    | 0.63 +or- 0.15               | 1.48 +or- 0.35 | cdots          | cdots          |
| Carina       | 93.79 +or- 6.43  | 22.76 +or- 0.97    | 0.31 +or- 0.04               | 0.77 +or- 0.24 | 0.23 +or- 0.07 | 0.46 +or- 0.16 |
| W51A^c^,^d     | 42.95 +or- 2.81  | 9.15 +or- 0.43     | 0.78 +or- 0.13               | 1.95 +or- 0.28 | cdots          | cdots          |
| NGC 3603     | 137.08 +or- 5.02 | 23.03 +or- 0.74    | 0.23 +or- 0.02               | 1.00 +or- 0.28 | <0.28          | 0.77 +or- 0.23 |
